OpenFOAM-9/chapter9/pitzDaily3D/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          600;
        startFace       715675;
    }
    outlet
    {
        type            patch;
        nFaces          1140;
        startFace       716275;
    }
    upperWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          4460;
        startFace       717415;
    }
    lowerWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          5000;
        startFace       721875;
    }
    front
    {
        type            cyclic;
        inGroups        List<word> 1(cyclic);
        nFaces          12225;
        startFace       726875;
        matchTolerance  0.0001;
        neighbourPatch  back;
        transformType   translational;
        separation      (0 0 0.03810000000000001);
    }
    back
    {
        type            cyclic;
        inGroups        List<word> 1(cyclic);
        nFaces          12225;
        startFace       739100;
        matchTolerance  0.0001;
        neighbourPatch  front;
        transformType   translational;
        separation      (0 0 -0.03810000000000001);
    }
)

// ************************************************************************* //
