OpenFOAM-9/chapter9/pitzDaily3D/constant/momentumTransport
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      momentumTransport;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

simulationType  LES;

RAS
{
    model           LaunderSharmaKE;

    turbulence      on;

    printCoeffs     on;
}

LES
{
LESModel        kEqn; //dynamicKEqn

delta           cubeRootVol;//vanDriest;

turbulence      on;

printCoeffs     on;

dynamicKEqnCoeffs
{
        filter simple;
}

cubeRootVolCoeffs
{
    deltaCoeff      1;
}

}

// ************************************************************************* //
